DataProcessors/FrontOfficeВыборСтола.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<DataProcessor>
		<Properties>
			<Name>FrontOfficeВыборСтола</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Стол</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Столы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПостфиксСтола</Name>
					<Comment>Постфикс места заказа</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимПоиска</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТаблицаСтолов</Name>
					<Type>
						<v8:Type>v8:ValueTable</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

DataProcessors/FrontOfficeВыборСтола/Ext/ObjectModule.bsl
#Если Клиент Тогда
	
// Функция выбора стола через числовую экранную клавиатура.
//
// Параметры:
//  Стол, СправочникСсылка.Столы. Начальное значение стола;
//	РежимПоиска, Булево. Включает ввод стола в режиме поиска;
//	ТаблицаСтолов, ТаблицаЗначений. Таблица доступных для выбора столов.
//
// Возвращаемое значение:
//	Булево. Истина - если был осуществлен выбор стола;
//  Стол, СправочникСсылка.Столы. Выбранны стол;
//  ПостфиксСтола, Число.4.0. Постфикс выбранного стола (только для режима поиска).
//
Функция ВыборСтола(Стол = Неопределено, ПостфиксСтола = Неопределено, РежимПоиска = Ложь, ТаблицаСтолов, ПолныйНомерСтола = Неопределено) Экспорт
	
	// Перенос параметров.
	ЭтотОбъект.Стол = Стол;
	ЭтотОбъект.ПостфиксСтола = ПостфиксСтола;
	ЭтотОбъект.РежимПоиска = РежимПоиска;
	ЭтотОбъект.ТаблицаСтолов = ТаблицаСтолов;
	
	// Открываем форму выбора.
	Форма = ЭтотОбъект.ПолучитьФорму("Форма");
	
	// Выбор значения.
	ПараметрЗакрытия = Форма.ОткрытьМодально();
	Если (ТипЗнч(ПараметрЗакрытия) = Тип("Булево"))  Тогда
		Стол = ЭтотОбъект.Стол;
		ПостфиксСтола = ЭтотОбъект.ПостфиксСтола;
		ПолныйНомерСтола = Строка(ЭтотОбъект.Стол.Код); Если Булево(ПостфиксСтола) Тогда ПолныйНомерСтола = ПолныйНомерСтола + "." + Строка(ПостфиксСтола); КонецЕсли;
		
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции // ВыборСтола()

#КонецЕсли
